## Plan Result (prod_landing - TerraformPlanApply)




<pre><code>Plan: 14 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.sftpkey[&#34;sftp&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_account_local_user.this[&#34;sftp&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;sftp&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_management_policy.this[&#34;sftp&#34;]
  * module.data_landing_zone[&#34;00&#34;].tls_private_key.sftpkey[&#34;sftp&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;sftp&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;sftp&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;sftp&#34;].azurerm_storage_container.container[&#34;sftp&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;sftp&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;sftp&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;sftp&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;sftp&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;sftp-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;sftp-dfs&#34;].azurerm_private_endpoint.this
* Update
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].azurerm_key_vault_secret.sftpkey["sftp"] will be created
  + resource "azurerm_key_vault_secret" "sftpkey" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.KeyVault/vaults/ingest00-meta002-prod"
      + name                    = "ingest00sftpprod-sftpkey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_storage_account_local_user.this["sftp"] will be created
  + resource "azurerm_storage_account_local_user" "this" {
      + home_directory       = "sftp"
      + id                   = (known after apply)
      + name                 = "sftpuser"
      + password             = (sensitive value)
      + sid                  = (sensitive value)
      + ssh_key_enabled      = true
      + ssh_password_enabled = false
      + storage_account_id   = (known after apply)

      + permission_scope {
          + resource_name = "sftp"
          + service       = "blob"

          + permissions {
              + create = true
              + delete = true
              + list   = true
              + read   = true
              + write  = true
            }
        }

      + ssh_authorized_key {
          + description = (known after apply)
          + key         = (known after apply)
        }
    }

  # module.data_landing_zone["00"].azurerm_storage_data_lake_gen2_filesystem.this["sftp"] will be created
  + resource "azurerm_storage_data_lake_gen2_filesystem" "this" {
      + default_encryption_scope = (known after apply)
      + group                    = (known after apply)
      + id                       = (known after apply)
      + name                     = "ingest00-sftp-prod"
      + owner                    = (known after apply)
      + storage_account_id       = (known after apply)

      + ace (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_storage_management_policy.this["sftp"] will be created
  + resource "azurerm_storage_management_policy" "this" {
      + id                 = (known after apply)
      + storage_account_id = (known after apply)

      + rule {
          + enabled = true
          + name    = "default"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = -1
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = -1
                  + tier_to_archive_after_days_since_creation_greater_than         = -1
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                  + tier_to_cold_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cold_after_days_since_modification_greater_than        = -1
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = 90
                }
              + snapshot {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 90
                  + delete_after_days_since_creation_greater_than                  = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                }
              + version {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 90
                  + delete_after_days_since_creation                               = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                }
            }

          + filters {
              + blob_types = [
                  + "blockBlob",
                ]
            }
        }
    }

  # module.data_landing_zone["00"].tls_private_key.sftpkey["sftp"] will be created
  + resource "tls_private_key" "sftpkey" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_database.this["MetadataControl"] will be updated in-place
  ~ resource "azurerm_mssql_database" "this" {
      ~ auto_pause_delay_in_minutes                                = 0 -> -1
        id                                                         = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-prod/databases/MetadataControl"
        name                                                       = "MetadataControl"
        tags                                                       = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["curated"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00curatedprod"
        name                               = "ingest00curatedprod"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["external"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00externalprod"
        name                               = "ingest00externalprod"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["landing"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00landingprod"
        name                               = "ingest00landingprod"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["raw"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00rawprod"
        name                               = "ingest00rawprod"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["sftp"].azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = {
          + properties = {
              + isEnabled                         = true
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = 5000
                      + isEnabled     = true
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = true
                }
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.data_landing_zone["00"].module.storage["sftp"].azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = true
      + is_hns_enabled                     = true
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "ingest00sftpprod"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "ingest00-main-prod"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = true
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "production"
          + "startupMode"         = "always"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days                     = 365
              + permanent_delete_enabled = false
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/aks-00",
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/aks-01",
            ]
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["sftp"].azurerm_storage_container.container["sftp"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "sftp"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest00sftpprod"
    }

  # module.data_landing_zone["00"].module.storage["sftp"].random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.data_landing_zone["00"].module.storage["sftp"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["sftp"].time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["sftp"].time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00workspaceprod"
        name                               = "ingest00workspaceprod"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["sftp-blob"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest00-sftp-blob-pe-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-main-prod"
      + subnet_id                = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-services-prod"
      + tags                     = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "production"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest00sftpprod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone["00"].module.storage_pe["sftp-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest00-sftp-dfs-pe-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-main-prod"
      + subnet_id                = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-services-prod"
      + tags                     = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "production"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest00sftpprod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

Plan: 14 to add, 6 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":80,"Program":"tfcmt","SHA1":"","Target":"prod_landing - TerraformPlanApply","Vars":{}} -->